src/InformationRegisters/цур_ПраваДоступа/цур_ПраваДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ПраваДоступа</name>
  <resources>
    <name>ЗначениеПрава</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПрава</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизитаТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/цур_ОграниченияДоступа/цур_ОграниченияДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ОграниченияДоступа</name>
  <resources>
    <name>УсловиеОграничения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПрава</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Поля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/цур_ШаблоныОграничений/цур_ШаблоныОграничений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ШаблоныОграничений</name>
  <resources>
    <name>ТекстШаблона</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/цур_ПодсистемыРолей/цур_ПодсистемыРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ПодсистемыРолей</name>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмяПодсистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/цур_ВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Запускает генерацию расширения ролей в фоновом задании.
//
// Параметры:
//  МассивСсылокРолей  - Массив                  - массив СправочникСсылка.цур_Роли
//  ИдентификаторФормы - УникальныйИдентификатор - идентификатор формы-владельца временного хранилища
//
// Возвращаемое значение:
//  Структура - описание запущенного задания:
//    * ИдентификаторЗадания - УникальныйИдентификатор - идентификатор фонового задания
//    * АдресХранилища       - Строка                  - адрес временного хранилища для результата
//
Функция СгенерироватьВФоне(МассивСсылокРолей, ИдентификаторФормы) Экспорт

	Если ТипЗнч(МассивСсылокРолей) <> Тип("Массив") Тогда
		ВызватьИсключение НСтр("ru = 'Параметр МассивСсылокРолей должен быть типа Массив.'");
	КонецЕсли;

	Если МассивСсылокРолей.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Параметр МассивСсылокРолей не должен быть пустым.'");
	КонецЕсли;

	Генератор = Обработки.цур_ГенераторРолей.Создать();
	Возврат Генератор.СгенерироватьВФоне(МассивСсылокРолей, ИдентификаторФормы);

КонецФункции

// Проверяет статус фонового задания генерации и возвращает результат при завершении.
//
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор - идентификатор фонового задания
//  АдресХранилища       - Строка                  - адрес временного хранилища результата
//
// Возвращаемое значение:
//  Структура - состояние задания:
//    * Завершено      - Булево    - Истина, если задание завершено (успешно или с ошибкой)
//    * Результат      - Структура - результат генерации (Неопределено, пока не завершено)
//    * ОписаниеОшибки - Строка   - текст ошибки выполнения задания (пусто при успехе)
//
Функция ПолучитьСтатусФоновогоЗадания(ИдентификаторЗадания, АдресХранилища) Экспорт

	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИдентификаторЗадания не заполнен.'");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АдресХранилища) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр АдресХранилища не заполнен.'");
	КонецЕсли;

	Генератор = Обработки.цур_ГенераторРолей.Создать();
	Возврат Генератор.ПолучитьРезультатФоновогоЗадания(ИдентификаторЗадания, АдресХранилища);

КонецФункции

// Заполняет права роли из указанного источника (роль конфигурации, профиль или пользователь).
//
// Параметры:
//  СсылкаРоли  - СправочникСсылка.цур_Роли - ссылка на роль, в которую записываются права
//  Источник    - Строка                     - имя роли конфигурации, профиля или пользователя ИБ
//  ТипИсточника - Строка                   - тип источника: "РольКонфигурации", "Профиль", "Пользователь"
//
Процедура ЗаполнитьПраваИзИсточника(СсылкаРоли, Источник, ТипИсточника) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаРоли) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр СсылкаРоли не заполнен.'");
	КонецЕсли;

	Если ПустаяСтрока(Источник) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр Источник не может быть пустым.'");
	КонецЕсли;

	Если ТипИсточника = "РольКонфигурации" Тогда
		цур_МодельРолейСервер.ЗаполнитьПраваИзРолиКонфигурации(СсылкаРоли, Источник);

	ИначеЕсли ТипИсточника = "Профиль" Тогда
		цур_МодельРолейСервер.ЗаполнитьПраваИзПрофиля(СсылкаРоли, Источник);

	ИначеЕсли ТипИсточника = "Пользователь" Тогда
		цур_МодельРолейСервер.ЗаполнитьПраваИзПользователя(СсылкаРоли, Источник);

	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный тип источника: ""%1"". Ожидается: РольКонфигурации, Профиль, Пользователь.'"),
			ТипИсточника);
	КонецЕсли;

КонецПроцедуры

// Строит дерево объектов метаданных для использования в UI.
// Корневые узлы - виды метаданных (Справочники, Документы и др.),
// дочерние узлы - конкретные объекты конфигурации.
//
// Возвращаемое значение:
//  ДеревоЗначений - дерево с колонками:
//    * Имя           - Строка  - программное имя объекта или вида
//    * ПолноеИмя     - Строка  - полное имя объекта (ВидМетаданных.ИмяОбъекта) или пусто для группы
//    * Представление - Строка  - синоним для отображения пользователю
//    * ВидМетаданных - Строка  - строковый идентификатор вида (например "Catalog")
//    * ЭтоГруппа     - Булево  - Истина для узлов-видов, Ложь для объектов
//
Функция ПолучитьДеревоОбъектов() Экспорт

	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипБулево = Новый ОписаниеТипов("Булево");

	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Имя",           ТипСтрока);
	Дерево.Колонки.Добавить("ПолноеИмя",     ТипСтрока);
	Дерево.Колонки.Добавить("Представление", ТипСтрока);
	Дерево.Колонки.Добавить("ВидМетаданных", ТипСтрока);
	Дерево.Колонки.Добавить("ЭтоГруппа",     ТипБулево);

	МассивВидов = цур_РеестрМетаданныхСерверПовтИсп.ВсеВидыМетаданных();

	Для Каждого ОписаниеВида Из МассивВидов Цикл

		СтрокаВида = Дерево.Строки.Добавить();
		СтрокаВида.Имя           = ОписаниеВида.ВидМетаданных;
		СтрокаВида.ПолноеИмя     = "";
		СтрокаВида.Представление = ОписаниеВида.Представление;
		СтрокаВида.ВидМетаданных = ОписаниеВида.ВидМетаданных;
		СтрокаВида.ЭтоГруппа     = Истина;

		КоллекцияМетаданных = Метаданные[ОписаниеВида.ИмяКоллекцииМетаданных];

		Для Каждого ОбъектМД Из КоллекцияМетаданных Цикл

			СтрокаОбъекта = СтрокаВида.Строки.Добавить();
			СтрокаОбъекта.Имя           = ОбъектМД.Имя;
			СтрокаОбъекта.ПолноеИмя     = СтрШаблон("%1.%2", ОписаниеВида.ВидМетаданных, ОбъектМД.Имя);
			СтрокаОбъекта.Представление = ОбъектМД.Синоним;
			СтрокаОбъекта.ВидМетаданных = ОписаниеВида.ВидМетаданных;
			СтрокаОбъекта.ЭтоГруппа     = Ложь;

		КонецЦикла;

	КонецЦикла;

	Возврат Дерево;

КонецФункции

// Возвращает права роли из регистра сведений цур_ПраваДоступа.
//
// Параметры:
//  СсылкаРоли   - СправочникСсылка.цур_Роли - ссылка на роль (обязательный)
//  ВидОбъекта   - Строка                     - фильтр по виду объекта, пустая строка — без фильтра
//  ИмяОбъекта   - Строка                     - фильтр по имени объекта, пустая строка — без фильтра
//
// Возвращаемое значение:
//  ТаблицаЗначений - права роли с колонками:
//    * ВидОбъекта    - Строка  - вид объекта метаданных
//    * ИмяОбъекта    - Строка  - имя объекта метаданных
//    * ИмяПрава      - Строка  - имя права (Read, Insert, Update и др.)
//    * ЗначениеПрава - Булево  - значение права
//    * ТипРеквизита  - Строка  - тип реквизита (для прав на реквизиты и ТЧ)
//    * ИмяРеквизита  - Строка  - имя реквизита
//    * ИмяРеквизитаТЧ - Строка - имя реквизита табличной части
//
Функция ПолучитьПраваРоли(СсылкаРоли, ВидОбъекта = "", ИмяОбъекта = "") Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаРоли) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр СсылкаРоли не заполнен.'");
	КонецЕсли;

	ОтборВидОбъекта = НЕ ПустаяСтрока(ВидОбъекта);
	ОтборИмяОбъекта = НЕ ПустаяСтрока(ИмяОбъекта);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Роль",            СсылкаРоли);
	Запрос.УстановитьПараметр("ВидОбъекта",      ВидОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта",      ИмяОбъекта);
	Запрос.УстановитьПараметр("ОтборВидОбъекта", ОтборВидОбъекта);
	Запрос.УстановитьПараметр("ОтборИмяОбъекта", ОтборИмяОбъекта);

	//BSLLS:LogicalOrInTheWhereSectionOfQuery-off
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РС.ВидОбъекта     КАК ВидОбъекта,
	|	РС.ИмяОбъекта     КАК ИмяОбъекта,
	|	РС.ИмяПрава       КАК ИмяПрава,
	|	РС.ЗначениеПрава  КАК ЗначениеПрава,
	|	РС.ТипРеквизита   КАК ТипРеквизита,
	|	РС.ИмяРеквизита   КАК ИмяРеквизита,
	|	РС.ИмяРеквизитаТЧ КАК ИмяРеквизитаТЧ
	|ИЗ
	|	РегистрСведений.цур_ПраваДоступа КАК РС
	|ГДЕ
	|	РС.Роль = &Роль
	|	И (НЕ &ОтборВидОбъекта ИЛИ РС.ВидОбъекта = &ВидОбъекта)
	|	И (НЕ &ОтборИмяОбъекта ИЛИ РС.ИмяОбъекта = &ИмяОбъекта)
	|УПОРЯДОЧИТЬ ПО
	|	РС.ВидОбъекта,
	|	РС.ИмяОбъекта,
	|	РС.ИмяПрава";
	//BSLLS:LogicalOrInTheWhereSectionOfQuery-on

	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Записывает одну запись права доступа в регистр цур_ПраваДоступа.
//
// Параметры:
//  СсылкаРоли     - СправочникСсылка.цур_Роли - ссылка на роль
//  ВидОбъекта     - Строка                     - вид объекта метаданных
//  ИмяОбъекта     - Строка                     - имя объекта метаданных
//  ИмяПрава       - Строка                     - имя права
//  Значение       - Булево                      - значение права
//  ДопПараметры   - Структура                   - дополнительные параметры реквизита (необязательный):
//    * ТипРеквизита   - Строка - тип реквизита
//    * ИмяРеквизита   - Строка - имя реквизита
//    * ИмяРеквизитаТЧ - Строка - имя реквизита табличной части
//
Процедура ЗаписатьПравоДоступа(
		СсылкаРоли,
		ВидОбъекта,
		ИмяОбъекта,
		ИмяПрава,
		Значение,
		ДопПараметры = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаРоли) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр СсылкаРоли не заполнен.'");
	КонецЕсли;

	Если ПустаяСтрока(ВидОбъекта) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ВидОбъекта не может быть пустым.'");
	КонецЕсли;

	Если ПустаяСтрока(ИмяОбъекта) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИмяОбъекта не может быть пустым.'");
	КонецЕсли;

	Если ПустаяСтрока(ИмяПрава) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр ИмяПрава не может быть пустым.'");
	КонецЕсли;

	ТипРеквизита   = "";
	ИмяРеквизита   = "";
	ИмяРеквизитаТЧ = "";

	Если ДопПараметры <> Неопределено Тогда
		ДопПараметры.Свойство("ТипРеквизита",   ТипРеквизита);
		ДопПараметры.Свойство("ИмяРеквизита",   ИмяРеквизита);
		ДопПараметры.Свойство("ИмяРеквизитаТЧ", ИмяРеквизитаТЧ);
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.цур_ПраваДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Роль.Установить(СсылкаРоли);
	НаборЗаписей.Отбор.ВидОбъекта.Установить(ВидОбъекта);
	НаборЗаписей.Отбор.ИмяОбъекта.Установить(ИмяОбъекта);
	НаборЗаписей.Отбор.ИмяПрава.Установить(ИмяПрава);
	НаборЗаписей.Отбор.ТипРеквизита.Установить(ТипРеквизита);
	НаборЗаписей.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);
	НаборЗаписей.Отбор.ИмяРеквизитаТЧ.Установить(ИмяРеквизитаТЧ);

	НоваяЗапись                = НаборЗаписей.Добавить();
	НоваяЗапись.Роль            = СсылкаРоли;
	НоваяЗапись.ВидОбъекта      = ВидОбъекта;
	НоваяЗапись.ИмяОбъекта      = ИмяОбъекта;
	НоваяЗапись.ИмяПрава        = ИмяПрава;
	НоваяЗапись.ЗначениеПрава   = Значение;
	НоваяЗапись.ТипРеквизита    = ТипРеквизита;
	НоваяЗапись.ИмяРеквизита    = ИмяРеквизита;
	НоваяЗапись.ИмяРеквизитаТЧ  = ИмяРеквизитаТЧ;

	НаборЗаписей.Записать(Ложь);

КонецПроцедуры

// Возвращает структуру дополнительных параметров для процедуры ЗаписатьПравоДоступа.
//
// Возвращаемое значение:
//  Структура - параметры реквизита:
//    * ТипРеквизита   - Строка - тип реквизита
//    * ИмяРеквизита   - Строка - имя реквизита
//    * ИмяРеквизитаТЧ - Строка - имя реквизита табличной части
//
Функция НовыеДопПараметрыПрава() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("ТипРеквизита",   "");
	Параметры.Вставить("ИмяРеквизита",   "");
	Параметры.Вставить("ИмяРеквизитаТЧ", "");

	Возврат Параметры;

КонецФункции

// Нормализует данные роли и выполняет валидацию.
//
// Параметры:
//  СсылкаРоли - СправочникСсылка.цур_Роли - ссылка на роль
//
// Возвращаемое значение:
//  Структура - результат валидации:
//    * Успешно - Булево - Истина, если ошибок нет
//    * Ошибки  - Массив - список строк с описанием найденных ошибок
//
Функция ВалидироватьРоль(СсылкаРоли) Экспорт //BSLLS:Typo-off

	Если НЕ ЗначениеЗаполнено(СсылкаРоли) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр СсылкаРоли не заполнен.'");
	КонецЕсли;

	МодельРоли = цур_МодельРолейСервер.НормализоватьРоль(СсылкаРоли);
	Возврат цур_МодельРолейСервер.ВалидироватьРоль(МодельРоли);

КонецФункции

// Строит дерево подсистем конфигурации рекурсивно.
//
// Возвращаемое значение:
//  ДеревоЗначений - дерево подсистем с колонками:
//    * Имя           - Строка - программное имя подсистемы
//    * ПолноеИмя     - Строка - полное имя подсистемы (включая родительские подсистемы)
//    * Представление - Строка - синоним подсистемы
//
Функция ПолучитьПодсистемыКонфигурации() Экспорт

	ТипСтр = Новый ОписаниеТипов("Строка");

	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Имя",                ТипСтр);
	Дерево.Колонки.Добавить("ПолноеИмя",          ТипСтр);
	Дерево.Колонки.Добавить("Представление",      ТипСтр);
	Дерево.Колонки.Добавить("КартинкаПодсистемы", Новый ОписаниеТипов("Картинка"));

	ЗаполнитьПодсистемыРекурсивно(Метаданные.Подсистемы, Дерево.Строки);

	Возврат Дерево;

КонецФункции

// Возвращает список имен ролей, определенных в конфигурации.
//
// Возвращаемое значение:
//  Массив из Строка - имена ролей конфигурации
//
Функция ПолучитьСписокРолейКонфигурации() Экспорт

	МассивИмен = Новый Массив;

	Для Каждого РольМД Из Метаданные.Роли Цикл
		МассивИмен.Добавить(РольМД.Имя);
	КонецЦикла;

	Возврат МассивИмен;

КонецФункции

// Возвращает ограничения доступа (RLS) роли из регистра цур_ОграниченияДоступа.
//
// Параметры:
//  СсылкаРоли - СправочникСсылка.цур_Роли - ссылка на роль
//
// Возвращаемое значение:
//  ТаблицаЗначений - ограничения роли с колонками:
//    * ВидОбъекта         - Строка - вид объекта метаданных
//    * ИмяОбъекта         - Строка - имя объекта метаданных
//    * ИмяПрава           - Строка - имя права
//    * УсловиеОграничения - Строка - текст условия ограничения
//    * Поля               - Строка - поля ограничения (разделённые переносом строки)
//
Функция ПолучитьОграниченияРоли(СсылкаРоли) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаРоли) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр СсылкаРоли не заполнен.'");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Роль", СсылкаРоли);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РС.ВидОбъекта          КАК ВидОбъекта,
	|	РС.ИмяОбъекта          КАК ИмяОбъекта,
	|	РС.ИмяПрава            КАК ИмяПрава,
	|	РС.УсловиеОграничения  КАК УсловиеОграничения,
	|	РС.Поля                КАК Поля
	|ИЗ
	|	РегистрСведений.цур_ОграниченияДоступа КАК РС
	|ГДЕ
	|	РС.Роль = &Роль
	|УПОРЯДОЧИТЬ ПО
	|	РС.ВидОбъекта,
	|	РС.ИмяОбъекта,
	|	РС.ИмяПрава";

	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Возвращает шаблоны ограничений доступа роли из регистра цур_ШаблоныОграничений.
//
// Параметры:
//  СсылкаРоли - СправочникСсылка.цур_Роли - ссылка на роль
//
// Возвращаемое значение:
//  ТаблицаЗначений - шаблоны роли с колонками:
//    * ИмяШаблона   - Строка - имя шаблона ограничения
//    * ТекстШаблона - Строка - текст шаблона
//
Функция ПолучитьШаблоныОграниченийРоли(СсылкаРоли) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаРоли) Тогда
		ВызватьИсключение НСтр("ru = 'Параметр СсылкаРоли не заполнен.'");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Роль", СсылкаРоли);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РС.ИмяШаблона   КАК ИмяШаблона,
	|	РС.ТекстШаблона КАК ТекстШаблона
	|ИЗ
	|	РегистрСведений.цур_ШаблоныОграничений КАК РС
	|ГДЕ
	|	РС.Роль = &Роль
	|УПОРЯДОЧИТЬ ПО
	|	РС.ИмяШаблона";

	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Точка входа фонового задания генерации расширения.
// Вызывается платформой через ФоновыеЗадания.Выполнить.
//
// Параметры:
//  МассивСсылокРолей - Массив - массив СправочникСсылка.цур_Роли
//  АдресХранилища    - Строка - адрес временного хранилища для результата
//
Процедура ВыполнитьГенерациюФоновое(МассивСсылокРолей, АдресХранилища) Экспорт

	ОбъектОбработки    = Обработки.цур_ГенераторРолей.Создать();
	РезультатГенерации = ОбъектОбработки.Сгенерировать(МассивСсылокРолей);

	ПоместитьВоВременноеХранилище(РезультатГенерации, АдресХранилища);

КонецПроцедуры

// Точка входа фонового задания загрузки ролей из базы.
//
// Параметры:
//  СсылкаИнформационнойБазы - СправочникСсылка.цур_ИнформационныеБазы
//  АдресХранилища           - Строка - адрес временного хранилища для результата
//
Процедура ВыполнитьЗагрузкуРолейИзБазы(СсылкаИнформационнойБазы, АдресХранилища) Экспорт

	ОбработкаОбъект = Обработки.цур_ЗагрузкаXMLРолей.Создать();
	Результат = ОбработкаОбъект.ЗагрузитьИзИнформационнойБазы(СсылкаИнформационнойБазы);

	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Рекурсивно обходит коллекцию подсистем и заполняет строки дерева.
//
// Параметры:
//  КоллекцияПодсистем - КоллекцияОбъектовМетаданных - коллекция подсистем текущего уровня
//  СтрокиДерева       - КоллекцияСтрокДерева         - строки родительского узла дерева
//
Процедура ЗаполнитьПодсистемыРекурсивно(КоллекцияПодсистем, СтрокиДерева)

	Для Каждого Подсистема Из КоллекцияПодсистем Цикл

		НоваяСтрока = СтрокиДерева.Добавить();
		НоваяСтрока.Имя                = Подсистема.Имя;
		НоваяСтрока.ПолноеИмя          = Подсистема.ПолноеИмя();
		НоваяСтрока.Представление      = Подсистема.Синоним;
		НоваяСтрока.КартинкаПодсистемы = БиблиотекаКартинок.Подсистема;

		Если Подсистема.Подсистемы.Количество() > 0 Тогда
			ЗаполнитьПодсистемыРекурсивно(Подсистема.Подсистемы, НоваяСтрока.Строки);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Подготавливает данные роли для отображения на форме.
// Вызывается в фоновом задании.
//
// Параметры:
//  Параметры       - Структура - содержит ключ СсылкаРоли (СправочникСсылка.цур_Роли)
//  АдресРезультата - Строка    - адрес временного хранилища для результата
//
Процедура ПодготовитьДанныеРоли(Параметры, АдресРезультата) Экспорт

	СсылкаРоли = Параметры.СсылкаРоли;

	ТаблицаПрав        = ПолучитьПраваРоли(СсылкаРоли);
	ТаблицаОграничений = ПолучитьОграниченияРоли(СсылкаРоли);
	ТаблицаШаблонов    = ПолучитьШаблоныОграниченийРоли(СсылкаРоли);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РС.ПолноеИмяПодсистемы КАК ПолноеИмяПодсистемы
	|ИЗ
	|	РегистрСведений.цур_ПодсистемыРолей КАК РС
	|ГДЕ
	|	РС.Роль = &Роль";
	Запрос.УстановитьПараметр("Роль", СсылкаРоли);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	МассивПодсистем = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивПодсистем.Добавить(Выборка.ПолноеИмяПодсистемы);
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("Права",       ТаблицаПрав);
	Результат.Вставить("Ограничения", ТаблицаОграничений);
	Результат.Вставить("Шаблоны",     ТаблицаШаблонов);
	Результат.Вставить("Подсистемы",  МассивПодсистем);

	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

КонецПроцедуры

#КонецОбласти
